--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\cliu\Documents\GitHub\PanelEconometrics\HW2\HW2_log.log
  log type:  text
 opened on:  13 Mar 2019, 12:22:41

. use "gasoline.dta", clear

. 
. 
. ******************************** Data Cleaning *********************************
. encode country, generate(ncountry)

. tsset ncountry year
       panel variable:  ncountry (strongly balanced)
        time variable:  year, 1960 to 1978
                delta:  1 unit

. gen iota = 1

. 
. *******************************************************************************
. * Question 1
. * (a) FE, country effects
. xtreg lgaspcar lincomep lrpmg lcarpcap, fe

Fixed-effects (within) regression               Number of obs     =        342
Group variable: ncountry                        Number of groups  =         18

R-sq:                                           Obs per group:
     within  = 0.8396                                         min =         19
     between = 0.5755                                         avg =       19.0
     overall = 0.6150                                         max =         19

                                                F(3,321)          =     560.09
corr(u_i, Xb)  = -0.2468                        Prob > F          =     0.0000

------------------------------------------------------------------------------
    lgaspcar |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lincomep |   .6622498    .073386     9.02   0.000     .5178715    .8066282
       lrpmg |  -.3217025   .0440992    -7.29   0.000    -.4084626   -.2349424
    lcarpcap |  -.6404829   .0296788   -21.58   0.000    -.6988726   -.5820933
       _cons |    2.40267   .2253094    10.66   0.000     1.959401     2.84594
-------------+----------------------------------------------------------------
     sigma_u |  .34841289
     sigma_e |  .09233034
         rho |  .93438173   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(17, 321) = 83.96                    Prob > F = 0.0000

. reg lgaspcar lincomep lrpmg lcarpcap  i.ncountry

      Source |       SS           df       MS      Number of obs   =       342
-------------+----------------------------------   F(20, 321)      =    586.56
       Model |   100.00647        20  5.00032352   Prob > F        =    0.0000
    Residual |  2.73649024       321  .008524892   R-squared       =    0.9734
-------------+----------------------------------   Adj R-squared   =    0.9717
       Total |  102.742961       341  .301299005   Root MSE        =    .09233

------------------------------------------------------------------------------
    lgaspcar |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lincomep |   .6622498    .073386     9.02   0.000     .5178715    .8066282
       lrpmg |  -.3217025   .0440992    -7.29   0.000    -.4084626   -.2349424
    lcarpcap |  -.6404829   .0296788   -21.58   0.000    -.6988726   -.5820933
             |
    ncountry |
    BELGIUM  |  -.1203045   .0341494    -3.52   0.000    -.1874895   -.0531196
     CANADA  |   .7559844   .0407455    18.55   0.000     .6758224    .8361464
    DENMARK  |   .1036004   .0366047     2.83   0.005      .031585    .1756157
     FRANCE  |  -.0810844   .0335634    -2.42   0.016    -.1471165   -.0150524
    GERMANY  |  -.1359874   .0318796    -4.27   0.000    -.1987067   -.0732681
     GREECE  |   .0512539   .0415296     1.23   0.218    -.0304507    .1329585
    IRELAND  |   .3064697   .0352937     8.68   0.000     .2370335    .3759059
      ITALY  |  -.0533077   .0371126    -1.44   0.152    -.1263224    .0197069
      JAPAN  |   .0900717   .0386066     2.33   0.020     .0141179    .1660256
   NETHERLA  |  -.0510644   .0335761    -1.52   0.129    -.1171214    .0149925
     NORWAY  |  -.0691552   .0404078    -1.71   0.088    -.1486528    .0103423
      SPAIN  |  -.6040788   .0912201    -6.62   0.000    -.7835437    -.424614
     SWEDEN  |    .740487   .1800842     4.11   0.000     .3861927    1.094781
   SWITZERL  |    .116647   .0347125     3.36   0.001     .0483543    .1849396
     TURKEY  |   .2241324   .0476443     4.70   0.000     .1303978    .3178669
       U.K.  |   .0595918   .0301882     1.97   0.049     .0002002    .1189834
     U.S.A.  |    .769395   .0445764    17.26   0.000     .6816962    .8570938
             |
       _cons |   2.285856   .2283235    10.01   0.000     1.836657    2.735056
------------------------------------------------------------------------------

. 
. matrix b = e(b)'

. matrix list b

b[22,1]
                     y1
   lincomep   .66224984
      lrpmg   -.3217025
   lcarpcap  -.64048292
1b.ncountry           0
 2.ncountry  -.12030454
 3.ncountry    .7559844
 4.ncountry   .10360037
 5.ncountry  -.08108444
 6.ncountry  -.13598739
 7.ncountry   .05125393
 8.ncountry   .30646971
 9.ncountry  -.05330773
10.ncountry   .09007174
11.ncountry  -.05106442
12.ncountry  -.06915523
13.ncountry  -.60407884
14.ncountry     .740487
15.ncountry   .11664696
16.ncountry   .22413237
17.ncountry    .0595918
18.ncountry   .76939498
      _cons   2.2858565

. matrix bhat = b[5..21,1..1]

. matrix list bhat

bhat[17,1]
                     y1
 2.ncountry  -.12030454
 3.ncountry    .7559844
 4.ncountry   .10360037
 5.ncountry  -.08108444
 6.ncountry  -.13598739
 7.ncountry   .05125393
 8.ncountry   .30646971
 9.ncountry  -.05330773
10.ncountry   .09007174
11.ncountry  -.05106442
12.ncountry  -.06915523
13.ncountry  -.60407884
14.ncountry     .740487
15.ncountry   .11664696
16.ncountry   .22413237
17.ncountry    .0595918
18.ncountry   .76939498

. matrix V = e(V)

. matrix list V

symmetric V[22,22]
                                                         1b.          2.          3.          4.          5.          6.          7.          8.          9.         10.
               lincomep       lrpmg    lcarpcap    ncountry    ncountry    ncountry    ncountry    ncountry    ncountry    ncountry    ncountry    ncountry    ncountry
   lincomep   .00538551
      lrpmg   .00028958   .00194474
   lcarpcap   -.0020491   .00008864   .00088083
1b.ncountry           0           0           0           0
 2.ncountry  -.00103984  -.00040791    .0003418           0   .00116618
 3.ncountry  -.00118948   .00087062   .00048707           0   .00052128    .0016602
 4.ncountry  -.00144984  -.00037777   .00049941           0   .00078796      .00064    .0013399
 5.ncountry  -.00062269  -.00056155   .00015061           0    .0006722   .00035482   .00070681    .0011265
 6.ncountry  -.00076792  -.00004865   .00026385           0    .0006043   .00063585   .00066384   .00055038   .00101631
 7.ncountry  -.00147225   -.0005664   .00066602           0   .00078787   .00041825    .0008795   .00069061   .00060714   .00172471
 8.ncountry   .00130903  -.00015896  -.00050654           0   .00023448   .00003684   .00012791   .00035411   .00025772   .00017806   .00124565
 9.ncountry   .00118895  -.00058378  -.00052082           0   .00033766  -.00012641   .00022971   .00048917   .00028219   .00028397   .00081436   .00137734
10.ncountry  -.00161066  -.00025271   .00068423           0    .0007707   .00065613    .0008847    .0006454   .00064873   .00110214   .00009356   .00014701   .00149047
11.ncountry  -.00104432  -.00028611   .00037114           0   .00069282   .00056985   .00076622   .00063336   .00059932    .0007874   .00022171   .00029539   .00077806
12.ncountry  -.00186278  -.00051814   .00065898           0   .00088607   .00066275   .00101689   .00078112   .00071818   .00105052   .00004433   .00017791   .00103442
13.ncountry  -.00515141  -.00243215    .0018225           0   .00181814    .0004776   .00214807   .00160081   .00116254   .00256482  -.00053135   .00003322   .00226767
14.ncountry   .01100502   .00476228  -.00380562           0  -.00242665   .00007537  -.00314939  -.00194631  -.00111997  -.00370634   .00261875   .00147901  -.00325459
15.ncountry  -.00028591   .00072587    .0001604           0   .00037403   .00088991     .000417   .00028863   .00049509   .00029171   .00028641   .00013721   .00044318
16.ncountry  -.00086117   .00054759   .00068024           0   .00044315   .00070336    .0005112   .00027054   .00046964   .00109761   .00022348   .00005306   .00097473
17.ncountry   .00004492  -.00010826  -.00005268           0   .00046546   .00040367   .00046018   .00048333   .00045096   .00041759   .00046821   .00049626   .00041825
18.ncountry  -.00121851   .00111478   .00049916           0   .00048734   .00135557   .00061604   .00030051   .00064735   .00031717  -3.988e-06  -.00021481   .00061702
      _cons   .01496728   .00350113   -.0047029           0  -.00398601  -.00299527   -.0050858  -.00319946  -.00283715  -.00384044   .00300289    .0019354  -.00437387

                     11.         12.         13.         14.         15.         16.         17.         18.            
               ncountry    ncountry    ncountry    ncountry    ncountry    ncountry    ncountry    ncountry       _cons
11.ncountry   .00112735
12.ncountry   .00085993   .00163279
13.ncountry   .00170187   .00269041   .00832111
14.ncountry  -.00218097  -.00425742  -.01478757    .0324303
15.ncountry   .00041653   .00038903  -.00013189   .00148168   .00120495
16.ncountry   .00053584   .00059367   .00091434  -.00020123   .00063311   .00226998
17.ncountry   .00045391   .00045913     .000504   .00031566    .0004112   .00032012   .00091133
18.ncountry   .00054694   .00062157   .00020541   .00056175   .00099332   .00069598    .0003966   .00198706
      _cons  -.00369458  -.00626917  -.01702915   .03553864  -.00042653   .00056619  -.00069245  -.00294735   .05213161

. matrix Vhat = V[5..21,5..21]

. matrix list Vhat

symmetric Vhat[17,17]
                      2.          3.          4.          5.          6.          7.          8.          9.         10.         11.         12.         13.         14.
               ncountry    ncountry    ncountry    ncountry    ncountry    ncountry    ncountry    ncountry    ncountry    ncountry    ncountry    ncountry    ncountry
 2.ncountry   .00116618
 3.ncountry   .00052128    .0016602
 4.ncountry   .00078796      .00064    .0013399
 5.ncountry    .0006722   .00035482   .00070681    .0011265
 6.ncountry    .0006043   .00063585   .00066384   .00055038   .00101631
 7.ncountry   .00078787   .00041825    .0008795   .00069061   .00060714   .00172471
 8.ncountry   .00023448   .00003684   .00012791   .00035411   .00025772   .00017806   .00124565
 9.ncountry   .00033766  -.00012641   .00022971   .00048917   .00028219   .00028397   .00081436   .00137734
10.ncountry    .0007707   .00065613    .0008847    .0006454   .00064873   .00110214   .00009356   .00014701   .00149047
11.ncountry   .00069282   .00056985   .00076622   .00063336   .00059932    .0007874   .00022171   .00029539   .00077806   .00112735
12.ncountry   .00088607   .00066275   .00101689   .00078112   .00071818   .00105052   .00004433   .00017791   .00103442   .00085993   .00163279
13.ncountry   .00181814    .0004776   .00214807   .00160081   .00116254   .00256482  -.00053135   .00003322   .00226767   .00170187   .00269041   .00832111
14.ncountry  -.00242665   .00007537  -.00314939  -.00194631  -.00111997  -.00370634   .00261875   .00147901  -.00325459  -.00218097  -.00425742  -.01478757    .0324303
15.ncountry   .00037403   .00088991     .000417   .00028863   .00049509   .00029171   .00028641   .00013721   .00044318   .00041653   .00038903  -.00013189   .00148168
16.ncountry   .00044315   .00070336    .0005112   .00027054   .00046964   .00109761   .00022348   .00005306   .00097473   .00053584   .00059367   .00091434  -.00020123
17.ncountry   .00046546   .00040367   .00046018   .00048333   .00045096   .00041759   .00046821   .00049626   .00041825   .00045391   .00045913     .000504   .00031566
18.ncountry   .00048734   .00135557   .00061604   .00030051   .00064735   .00031717  -3.988e-06  -.00021481   .00061702   .00054694   .00062157   .00020541   .00056175

                     15.         16.         17.         18.
               ncountry    ncountry    ncountry    ncountry
15.ncountry   .00120495
16.ncountry   .00063311   .00226998
17.ncountry    .0004112   .00032012   .00091133
18.ncountry   .00099332   .00069598    .0003966   .00198706

. 
. mata: I_N = I(17)

. mata: st_matrix("r(I_N)",I_N)

. 
. matrix R = r(I_N)

. matrix list R

symmetric R[17,17]
      c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17
 r1    1
 r2    0    1
 r3    0    0    1
 r4    0    0    0    1
 r5    0    0    0    0    1
 r6    0    0    0    0    0    1
 r7    0    0    0    0    0    0    1
 r8    0    0    0    0    0    0    0    1
 r9    0    0    0    0    0    0    0    0    1
r10    0    0    0    0    0    0    0    0    0    1
r11    0    0    0    0    0    0    0    0    0    0    1
r12    0    0    0    0    0    0    0    0    0    0    0    1
r13    0    0    0    0    0    0    0    0    0    0    0    0    1
r14    0    0    0    0    0    0    0    0    0    0    0    0    0    1
r15    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1
r16    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1
r17    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1

. matrix q = J(17,1,0)

. matrix list q

q[17,1]
     c1
 r1   0
 r2   0
 r3   0
 r4   0
 r5   0
 r6   0
 r7   0
 r8   0
 r9   0
r10   0
r11   0
r12   0
r13   0
r14   0
r15   0
r16   0
r17   0

. 
. matrix mhat = R*bhat-q

. matrix list mhat

mhat[17,1]
             c1
 r1  -.12030454
 r2    .7559844
 r3   .10360037
 r4  -.08108444
 r5  -.13598739
 r6   .05125393
 r7   .30646971
 r8  -.05330773
 r9   .09007174
r10  -.05106442
r11  -.06915523
r12  -.60407884
r13     .740487
r14   .11664696
r15   .22413237
r16    .0595918
r17   .76939498

. matrix covmatrixm = R*Vhat*R'

. matrix list covmatrixm

symmetric covmatrixm[17,17]
             r1          r2          r3          r4          r5          r6          r7          r8          r9         r10         r11         r12         r13         r14
 r1   .00116618
 r2   .00052128    .0016602
 r3   .00078796      .00064    .0013399
 r4    .0006722   .00035482   .00070681    .0011265
 r5    .0006043   .00063585   .00066384   .00055038   .00101631
 r6   .00078787   .00041825    .0008795   .00069061   .00060714   .00172471
 r7   .00023448   .00003684   .00012791   .00035411   .00025772   .00017806   .00124565
 r8   .00033766  -.00012641   .00022971   .00048917   .00028219   .00028397   .00081436   .00137734
 r9    .0007707   .00065613    .0008847    .0006454   .00064873   .00110214   .00009356   .00014701   .00149047
r10   .00069282   .00056985   .00076622   .00063336   .00059932    .0007874   .00022171   .00029539   .00077806   .00112735
r11   .00088607   .00066275   .00101689   .00078112   .00071818   .00105052   .00004433   .00017791   .00103442   .00085993   .00163279
r12   .00181814    .0004776   .00214807   .00160081   .00116254   .00256482  -.00053135   .00003322   .00226767   .00170187   .00269041   .00832111
r13  -.00242665   .00007537  -.00314939  -.00194631  -.00111997  -.00370634   .00261875   .00147901  -.00325459  -.00218097  -.00425742  -.01478757    .0324303
r14   .00037403   .00088991     .000417   .00028863   .00049509   .00029171   .00028641   .00013721   .00044318   .00041653   .00038903  -.00013189   .00148168   .00120495
r15   .00044315   .00070336    .0005112   .00027054   .00046964   .00109761   .00022348   .00005306   .00097473   .00053584   .00059367   .00091434  -.00020123   .00063311
r16   .00046546   .00040367   .00046018   .00048333   .00045096   .00041759   .00046821   .00049626   .00041825   .00045391   .00045913     .000504   .00031566    .0004112
r17   .00048734   .00135557   .00061604   .00030051   .00064735   .00031717  -3.988e-06  -.00021481   .00061702   .00054694   .00062157   .00020541   .00056175   .00099332

            r15         r16         r17
r15   .00226998
r16   .00032012   .00091133
r17   .00069598    .0003966   .00198706

. 
. local J = 17

. matrix F = mhat'*invsym(covmatrixm)*mhat/`J' 

. matrix list F

symmetric F[1,1]
           c1
c1  83.960824

. 
. * b) FE, time effects
. xtreg lgaspcar lincomep lrpmg lcarpcap i.year, fe

Fixed-effects (within) regression               Number of obs     =        342
Group variable: ncountry                        Number of groups  =         18

R-sq:                                           Obs per group:
     within  = 0.8829                                         min =         19
     between = 0.5134                                         avg =       19.0
     overall = 0.5554                                         max =         19

                                                F(21,303)         =     108.84
corr(u_i, Xb)  = -0.5107                        Prob > F          =     0.0000

------------------------------------------------------------------------------
    lgaspcar |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lincomep |   .0513687   .0913862     0.56   0.574    -.1284632    .2312007
       lrpmg |  -.1928498   .0428598    -4.50   0.000    -.2771904   -.1085092
    lcarpcap |  -.5934477   .0276693   -21.45   0.000    -.6478961   -.5389994
             |
        year |
       1961  |   .0409697   .0272476     1.50   0.134    -.0126488    .0945881
       1962  |   .0442492   .0275952     1.60   0.110    -.0100533    .0985516
       1963  |   .0647444   .0282765     2.29   0.023     .0091011    .1203876
       1964  |   .1059944   .0292974     3.62   0.000     .0483423    .1636466
       1965  |   .1241339   .0300492     4.13   0.000     .0650024    .1832654
       1966  |   .1678297   .0310464     5.41   0.000     .1067359    .2289235
       1967  |   .1988323   .0320478     6.20   0.000     .1357678    .2618967
       1968  |   .2300765   .0332006     6.93   0.000     .1647436    .2954095
       1969  |    .242999   .0353038     6.88   0.000     .1735273    .3124707
       1970  |   .2750797   .0371819     7.40   0.000     .2019123     .348247
       1971  |   .3041981    .038516     7.90   0.000     .2284053    .3799908
       1972  |   .3321357    .040532     8.19   0.000     .2523759    .4118954
       1973  |   .3697066   .0432093     8.56   0.000     .2846782     .454735
       1974  |   .3279376   .0422317     7.77   0.000     .2448331    .4110421
       1975  |   .3623918   .0418767     8.65   0.000     .2799859    .4447977
       1976  |   .3708908   .0436262     8.50   0.000     .2850421    .4567395
       1977  |    .385702   .0445593     8.66   0.000     .2980171    .4733869
       1978  |    .400956   .0464087     8.64   0.000     .3096317    .4922803
             |
       _cons |  -1.083988    .403018    -2.69   0.008    -1.877056   -.2909195
-------------+----------------------------------------------------------------
     sigma_u |  .42773185
     sigma_e |  .08118269
         rho |  .96522924   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(17, 303) = 113.35                   Prob > F = 0.0000

. testparm i.year

 ( 1)  1961.year = 0
 ( 2)  1962.year = 0
 ( 3)  1963.year = 0
 ( 4)  1964.year = 0
 ( 5)  1965.year = 0
 ( 6)  1966.year = 0
 ( 7)  1967.year = 0
 ( 8)  1968.year = 0
 ( 9)  1969.year = 0
 (10)  1970.year = 0
 (11)  1971.year = 0
 (12)  1972.year = 0
 (13)  1973.year = 0
 (14)  1974.year = 0
 (15)  1975.year = 0
 (16)  1976.year = 0
 (17)  1977.year = 0
 (18)  1978.year = 0

       F( 18,   303) =    6.23
            Prob > F =    0.0000

. xtreg lgaspcar lincomep lrpmg lcarpcap i.year, fe

Fixed-effects (within) regression               Number of obs     =        342
Group variable: ncountry                        Number of groups  =         18

R-sq:                                           Obs per group:
     within  = 0.8829                                         min =         19
     between = 0.5134                                         avg =       19.0
     overall = 0.5554                                         max =         19

                                                F(21,303)         =     108.84
corr(u_i, Xb)  = -0.5107                        Prob > F          =     0.0000

------------------------------------------------------------------------------
    lgaspcar |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lincomep |   .0513687   .0913862     0.56   0.574    -.1284632    .2312007
       lrpmg |  -.1928498   .0428598    -4.50   0.000    -.2771904   -.1085092
    lcarpcap |  -.5934477   .0276693   -21.45   0.000    -.6478961   -.5389994
             |
        year |
       1961  |   .0409697   .0272476     1.50   0.134    -.0126488    .0945881
       1962  |   .0442492   .0275952     1.60   0.110    -.0100533    .0985516
       1963  |   .0647444   .0282765     2.29   0.023     .0091011    .1203876
       1964  |   .1059944   .0292974     3.62   0.000     .0483423    .1636466
       1965  |   .1241339   .0300492     4.13   0.000     .0650024    .1832654
       1966  |   .1678297   .0310464     5.41   0.000     .1067359    .2289235
       1967  |   .1988323   .0320478     6.20   0.000     .1357678    .2618967
       1968  |   .2300765   .0332006     6.93   0.000     .1647436    .2954095
       1969  |    .242999   .0353038     6.88   0.000     .1735273    .3124707
       1970  |   .2750797   .0371819     7.40   0.000     .2019123     .348247
       1971  |   .3041981    .038516     7.90   0.000     .2284053    .3799908
       1972  |   .3321357    .040532     8.19   0.000     .2523759    .4118954
       1973  |   .3697066   .0432093     8.56   0.000     .2846782     .454735
       1974  |   .3279376   .0422317     7.77   0.000     .2448331    .4110421
       1975  |   .3623918   .0418767     8.65   0.000     .2799859    .4447977
       1976  |   .3708908   .0436262     8.50   0.000     .2850421    .4567395
       1977  |    .385702   .0445593     8.66   0.000     .2980171    .4733869
       1978  |    .400956   .0464087     8.64   0.000     .3096317    .4922803
             |
       _cons |  -1.083988    .403018    -2.69   0.008    -1.877056   -.2909195
-------------+----------------------------------------------------------------
     sigma_u |  .42773185
     sigma_e |  .08118269
         rho |  .96522924   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(17, 303) = 113.35                   Prob > F = 0.0000

. 
. matrix b = e(b)'

. matrix list b

b[23,1]
                    y1
  lincomep   .05136874
     lrpmg   -.1928498
  lcarpcap  -.59344773
1960b.year           0
 1961.year   .04096966
 1962.year   .04424918
 1963.year   .06474436
 1964.year   .10599444
 1965.year   .12413387
 1966.year   .16782969
 1967.year   .19883227
 1968.year   .23007652
 1969.year     .242999
 1970.year   .27507966
 1971.year   .30419807
 1972.year   .33213565
 1973.year    .3697066
 1974.year   .32793759
 1975.year   .36239179
 1976.year   .37089078
 1977.year   .38570199
 1978.year     .400956
     _cons  -1.0839879

. matrix V = e(V)

. matrix list V

symmetric V[23,23]
                                                     1960b.       1961.       1962.       1963.       1964.       1965.       1966.       1967.       1968.       1969.
              lincomep       lrpmg    lcarpcap        year        year        year        year        year        year        year        year        year        year
  lincomep   .00835144
     lrpmg  -.00037565   .00183697
  lcarpcap  -.00205476    .0001051   .00076559
1960b.year           0           0           0           0
 1961.year  -.00014039   .00008206   3.910e-07           0   .00074243
 1962.year  -.00014251   .00013147   -.0000328           0   .00038292   .00076149
 1963.year   -.0003176   .00018798  -.00002084           0   .00039208   .00040999   .00079956
 1964.year  -.00046131   .00027074  -.00001597           0   .00040181   .00042589   .00045812   .00085834
 1965.year   -.0004929   .00028089  -.00004198           0   .00040722   .00043598   .00047319   .00051222   .00090295
 1966.year   -.0006578    .0003022  -.00002631           0    .0004139   .00044636   .00049043   .00053585   .00056439   .00096388
 1967.year  -.00077116   .00032192  -.00002351           0   .00041978   .00045596   .00050585   .00055684   .00058916   .00062727   .00102706
 1968.year  -.00090046   .00035037  -.00001552           0   .00042609   .00046606   .00052216   .00057919   .00061523   .00065838   .00069628   .00110228
 1969.year  -.00119936   .00041307   .00003219           0   .00043666   .00048147   .00054832   .00061568   .00065649   .00070844   .00075333   .00080084   .00124636
 1970.year  -.00141922   .00048201   .00006687           0   .00044546   .00049452   .00056995   .00064594   .00069044   .00074909   .00079936   .00085284   .00094367
 1971.year  -.00158415   .00048985   .00008914           0   .00045069   .00050221   .00058333   .00066436   .00071187   .00077553   .00082982   .00088755   .00098614
 1972.year   -.0018001   .00054389   .00012172           0   .00045895   .00051445   .00060381    .0006929   .00074416   .00081443   .00087403   .00093757   .00104719
 1973.year  -.00209241    .0006304   .00017557           0   .00046939   .00052939   .00062909    .0007285   .00078363   .00086202   .00092798   .00099867   .00112261
 1974.year  -.00205495   .00040641   .00015036           0   .00046144    .0005173   .00061201   .00070319   .00075899   .00083633    .0009014   .00097008   .00108812
 1975.year  -.00190844   .00039536    .0000996           0   .00046075   .00051837   .00061167   .00070189   .00075903   .00083486   .00089932   .00096703   .00108119
 1976.year   -.0021209   .00042112   .00013779           0   .00046689   .00052687   .00062677   .00072302   .00078289    .0008644   .00093326   .00100577   .00112939
 1977.year  -.00216186   .00046578   .00013332           0   .00047134   .00053443   .00063814   .00073865   .00080082   .00088489   .00095608   .00103113   .00115887
 1978.year  -.00237279    .0005282   .00017575           0    .0004784   .00054427     .000655   .00076254   .00082704   .00091662   .00099206   .00107194   .00120965
     _cons    .0336872  -.00074786  -.00569067           0  -.00124634  -.00157373  -.00257313  -.00342997  -.00389116  -.00479972  -.00550213  -.00625321  -.00769917

                  1970.       1971.       1972.       1973.       1974.       1975.       1976.       1977.       1978.            
                  year        year        year        year        year        year        year        year        year       _cons
 1970.year   .00138249
 1971.year   .00106457   .00148348
 1972.year   .00113433   .00119285   .00164284
 1973.year   .00122124   .00128686   .00138154   .00186705
 1974.year   .00117965   .00124549   .00133495   .00144507   .00178351
 1975.year   .00116984   .00123382   .00132056   .00142642   .00140073   .00175366
 1976.year   .00122525   .00129443   .00138819   .00150316   .00147533   .00145914   .00190325
 1977.year   .00125833   .00132937   .00142643   .00154562    .0015132   .00149702   .00157722   .00198553
 1978.year   .00131713   .00139304   .00149763   .00162704   .00158776   .00156831   .00165487   .00169989   .00215377
     _cons  -.00875875  -.00960651  -.01066685  -.01200025  -.01208695  -.01164424  -.01263603  -.01293114  -.01385778   .16242348

. matrix bhat = b[5..22,1..1]

. matrix list bhat

bhat[18,1]
                  y1
1961.year  .04096966
1962.year  .04424918
1963.year  .06474436
1964.year  .10599444
1965.year  .12413387
1966.year  .16782969
1967.year  .19883227
1968.year  .23007652
1969.year    .242999
1970.year  .27507966
1971.year  .30419807
1972.year  .33213565
1973.year   .3697066
1974.year  .32793759
1975.year  .36239179
1976.year  .37089078
1977.year  .38570199
1978.year    .400956

. matrix Vhat = V[5..22,5..22]

. matrix list Vhat

symmetric Vhat[18,18]
                1961.      1962.      1963.      1964.      1965.      1966.      1967.      1968.      1969.      1970.      1971.      1972.      1973.      1974.      1975.
                year       year       year       year       year       year       year       year       year       year       year       year       year       year       year
1961.year  .00074243
1962.year  .00038292  .00076149
1963.year  .00039208  .00040999  .00079956
1964.year  .00040181  .00042589  .00045812  .00085834
1965.year  .00040722  .00043598  .00047319  .00051222  .00090295
1966.year   .0004139  .00044636  .00049043  .00053585  .00056439  .00096388
1967.year  .00041978  .00045596  .00050585  .00055684  .00058916  .00062727  .00102706
1968.year  .00042609  .00046606  .00052216  .00057919  .00061523  .00065838  .00069628  .00110228
1969.year  .00043666  .00048147  .00054832  .00061568  .00065649  .00070844  .00075333  .00080084  .00124636
1970.year  .00044546  .00049452  .00056995  .00064594  .00069044  .00074909  .00079936  .00085284  .00094367  .00138249
1971.year  .00045069  .00050221  .00058333  .00066436  .00071187  .00077553  .00082982  .00088755  .00098614  .00106457  .00148348
1972.year  .00045895  .00051445  .00060381   .0006929  .00074416  .00081443  .00087403  .00093757  .00104719  .00113433  .00119285  .00164284
1973.year  .00046939  .00052939  .00062909   .0007285  .00078363  .00086202  .00092798  .00099867  .00112261  .00122124  .00128686  .00138154  .00186705
1974.year  .00046144   .0005173  .00061201  .00070319  .00075899  .00083633   .0009014  .00097008  .00108812  .00117965  .00124549  .00133495  .00144507  .00178351
1975.year  .00046075  .00051837  .00061167  .00070189  .00075903  .00083486  .00089932  .00096703  .00108119  .00116984  .00123382  .00132056  .00142642  .00140073  .00175366
1976.year  .00046689  .00052687  .00062677  .00072302  .00078289   .0008644  .00093326  .00100577  .00112939  .00122525  .00129443  .00138819  .00150316  .00147533  .00145914
1977.year  .00047134  .00053443  .00063814  .00073865  .00080082  .00088489  .00095608  .00103113  .00115887  .00125833  .00132937  .00142643  .00154562   .0015132  .00149702
1978.year   .0004784  .00054427    .000655  .00076254  .00082704  .00091662  .00099206  .00107194  .00120965  .00131713  .00139304  .00149763  .00162704  .00158776  .00156831

                1976.      1977.      1978.
                year       year       year
1976.year  .00190325
1977.year  .00157722  .00198553
1978.year  .00165487  .00169989  .00215377

. 
. mata: I_N = I(18)

. mata: st_matrix("r(I_N)",I_N)

. 
. matrix R = r(I_N)

. matrix list R

symmetric R[18,18]
      c1   c2   c3   c4   c5   c6   c7   c8   c9  c10  c11  c12  c13  c14  c15  c16  c17  c18
 r1    1
 r2    0    1
 r3    0    0    1
 r4    0    0    0    1
 r5    0    0    0    0    1
 r6    0    0    0    0    0    1
 r7    0    0    0    0    0    0    1
 r8    0    0    0    0    0    0    0    1
 r9    0    0    0    0    0    0    0    0    1
r10    0    0    0    0    0    0    0    0    0    1
r11    0    0    0    0    0    0    0    0    0    0    1
r12    0    0    0    0    0    0    0    0    0    0    0    1
r13    0    0    0    0    0    0    0    0    0    0    0    0    1
r14    0    0    0    0    0    0    0    0    0    0    0    0    0    1
r15    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1
r16    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1
r17    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1
r18    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    1

. matrix q = J(18,1,0)

. matrix list q

q[18,1]
     c1
 r1   0
 r2   0
 r3   0
 r4   0
 r5   0
 r6   0
 r7   0
 r8   0
 r9   0
r10   0
r11   0
r12   0
r13   0
r14   0
r15   0
r16   0
r17   0
r18   0

. matrix mhat = R*bhat-q

. matrix list mhat

mhat[18,1]
            c1
 r1  .04096966
 r2  .04424918
 r3  .06474436
 r4  .10599444
 r5  .12413387
 r6  .16782969
 r7  .19883227
 r8  .23007652
 r9    .242999
r10  .27507966
r11  .30419807
r12  .33213565
r13   .3697066
r14  .32793759
r15  .36239179
r16  .37089078
r17  .38570199
r18    .400956

. matrix covmatrixm = R*Vhat*R'

. matrix list covmatrixm

symmetric covmatrixm[18,18]
            r1         r2         r3         r4         r5         r6         r7         r8         r9        r10        r11        r12        r13        r14        r15
 r1  .00074243
 r2  .00038292  .00076149
 r3  .00039208  .00040999  .00079956
 r4  .00040181  .00042589  .00045812  .00085834
 r5  .00040722  .00043598  .00047319  .00051222  .00090295
 r6   .0004139  .00044636  .00049043  .00053585  .00056439  .00096388
 r7  .00041978  .00045596  .00050585  .00055684  .00058916  .00062727  .00102706
 r8  .00042609  .00046606  .00052216  .00057919  .00061523  .00065838  .00069628  .00110228
 r9  .00043666  .00048147  .00054832  .00061568  .00065649  .00070844  .00075333  .00080084  .00124636
r10  .00044546  .00049452  .00056995  .00064594  .00069044  .00074909  .00079936  .00085284  .00094367  .00138249
r11  .00045069  .00050221  .00058333  .00066436  .00071187  .00077553  .00082982  .00088755  .00098614  .00106457  .00148348
r12  .00045895  .00051445  .00060381   .0006929  .00074416  .00081443  .00087403  .00093757  .00104719  .00113433  .00119285  .00164284
r13  .00046939  .00052939  .00062909   .0007285  .00078363  .00086202  .00092798  .00099867  .00112261  .00122124  .00128686  .00138154  .00186705
r14  .00046144   .0005173  .00061201  .00070319  .00075899  .00083633   .0009014  .00097008  .00108812  .00117965  .00124549  .00133495  .00144507  .00178351
r15  .00046075  .00051837  .00061167  .00070189  .00075903  .00083486  .00089932  .00096703  .00108119  .00116984  .00123382  .00132056  .00142642  .00140073  .00175366
r16  .00046689  .00052687  .00062677  .00072302  .00078289   .0008644  .00093326  .00100577  .00112939  .00122525  .00129443  .00138819  .00150316  .00147533  .00145914
r17  .00047134  .00053443  .00063814  .00073865  .00080082  .00088489  .00095608  .00103113  .00115887  .00125833  .00132937  .00142643  .00154562   .0015132  .00149702
r18   .0004784  .00054427    .000655  .00076254  .00082704  .00091662  .00099206  .00107194  .00120965  .00131713  .00139304  .00149763  .00162704  .00158776  .00156831

           r16        r17        r18
r16  .00190325
r17  .00157722  .00198553
r18  .00165487  .00169989  .00215377

. 
. local J = 18

. matrix F = mhat'*invsym(covmatrixm)*mhat/`J'

. matrix list F

symmetric F[1,1]
           c1
c1  6.2338473

. 
. * c) RE, country effects
. xtreg lgaspcar lincomep lrpmg lcarpcap, mle

Fitting constant-only model:
Iteration 0:   log likelihood = -22.421481
Iteration 1:   log likelihood = -22.396814
Iteration 2:   log likelihood = -22.396801

Fitting full model:
Iteration 0:   log likelihood =  216.74308
Iteration 1:   log likelihood =  230.51837
Iteration 2:   log likelihood =   273.0581
Iteration 3:   log likelihood =  281.79287
Iteration 4:   log likelihood =  282.47033
Iteration 5:   log likelihood =  282.47697
Iteration 6:   log likelihood =  282.47697

Random-effects ML regression                    Number of obs     =        342
Group variable: ncountry                        Number of groups  =         18

Random effects u_i ~ Gaussian                   Obs per group:
                                                              min =         19
                                                              avg =       19.0
                                                              max =         19

                                                LR chi2(3)        =     609.75
Log likelihood  =  282.47697                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
    lgaspcar |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lincomep |   .5881334   .0659581     8.92   0.000     .4588578     .717409
       lrpmg |  -.3780466   .0440663    -8.58   0.000     -.464415   -.2916782
    lcarpcap |  -.6163722   .0272054   -22.66   0.000    -.6696938   -.5630506
       _cons |   2.136168   .2156039     9.91   0.000     1.713593    2.558744
-------------+----------------------------------------------------------------
    /sigma_u |   .2922939   .0545496                      .2027512    .4213821
    /sigma_e |   .0922537   .0036482                      .0853734    .0996885
         rho |   .9094086   .0317608                      .8303747    .9571561
------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 463.97             Prob >= chibar2 = 0.000

. ereturn list

scalars:
               e(ll_0) =  -22.39680135026418
                 e(ll) =  282.4769678358167
               e(df_m) =  3
               e(chi2) =  609.7475383721618
                e(N_g) =  18
              e(g_min) =  19
              e(g_avg) =  19
              e(g_max) =  19
                  e(N) =  342
               e(rank) =  6
               e(ll_c) =  50.49288163280834
             e(chi2_c) =  463.9681724060167
            e(sigma_u) =  .2922938917847077
            e(sigma_e) =  .0922536814355045
                e(rho) =  .9094085966018441
                  e(p) =  6.5819773967e-103

macros:
            e(cmdline) : "xtreg lgaspcar lincomep lrpmg lcarpcap, mle"
             e(depvar) : "lgaspcar"
                e(cmd) : "xtreg"
               e(ivar) : "ncountry"
       e(marginsnotok) : "E U UE SCore STDP XBU"
            e(predict) : "xtrefe_p"
                e(vce) : "oim"
            e(chi2_ct) : "LR"
         e(properties) : "b V"
              e(model) : "ml"
              e(title) : "Random-effects ML regression"
            e(distrib) : "Gaussian"
           e(chi2type) : "LR"

matrices:
                  e(b) :  1 x 6
                  e(V) :  6 x 6

functions:
             e(sample)   

. local ll_u = e(ll)

. reg lgaspcar lincomep lrpmg lcarpcap

      Source |       SS           df       MS      Number of obs   =       342
-------------+----------------------------------   F(3, 338)       =    664.00
       Model |  87.8386024         3  29.2795341   Prob > F        =    0.0000
    Residual |  14.9043581       338  .044095734   R-squared       =    0.8549
-------------+----------------------------------   Adj R-squared   =    0.8536
       Total |  102.742961       341  .301299005   Root MSE        =    .20999

------------------------------------------------------------------------------
    lgaspcar |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lincomep |   .8899616   .0358058    24.86   0.000     .8195313    .9603919
       lrpmg |  -.8917979   .0303147   -29.42   0.000    -.9514272   -.8321685
    lcarpcap |  -.7633727   .0186083   -41.02   0.000    -.7999754   -.7267701
       _cons |   2.391326   .1169343    20.45   0.000     2.161315    2.621336
------------------------------------------------------------------------------

. ereturn list

scalars:
                  e(N) =  342
               e(df_m) =  3
               e(df_r) =  338
                  e(F) =  663.9992454490358
                 e(r2) =  .8549354813838124
               e(rmse) =  .2099898427715032
                e(mss) =  87.83860244442768
                e(rss) =  14.90435811471381
               e(r2_a) =  .8536479264848521
                 e(ll) =  50.49288163280834
               e(ll_0) =  -279.6357305704827
               e(rank) =  4

macros:
            e(cmdline) : "regress lgaspcar lincomep lrpmg lcarpcap"
              e(title) : "Linear regression"
          e(marginsok) : "XB default"
                e(vce) : "ols"
             e(depvar) : "lgaspcar"
                e(cmd) : "regress"
         e(properties) : "b V"
            e(predict) : "regres_p"
              e(model) : "ols"
          e(estat_cmd) : "regress_estat"

matrices:
                  e(b) :  1 x 4
                  e(V) :  4 x 4

functions:
             e(sample)   

. local ll_r = e(ll)

. local LR = -2*(`ll_r'-`ll_u')

. di `LR'
463.96817

. 
. xtreg lgaspcar lincomep lrpmg lcarpcap, re

Random-effects GLS regression                   Number of obs     =        342
Group variable: ncountry                        Number of groups  =         18

R-sq:                                           Obs per group:
     within  = 0.8363                                         min =         19
     between = 0.7099                                         avg =       19.0
     overall = 0.7309                                         max =         19

                                                Wald chi2(3)      =    1642.20
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
    lgaspcar |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lincomep |   .5549858   .0591282     9.39   0.000     .4390967    .6708749
       lrpmg |  -.4203893   .0399781   -10.52   0.000     -.498745   -.3420336
    lcarpcap |  -.6068402    .025515   -23.78   0.000    -.6568487   -.5568316
       _cons |   1.996699    .184326    10.83   0.000     1.635427    2.357971
-------------+----------------------------------------------------------------
     sigma_u |  .19554468
     sigma_e |  .09233034
         rho |  .81769856   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. ereturn list

scalars:
               e(rank) =  4
               e(df_m) =  3
               e(chi2) =  1642.198937928728
                  e(p) =  0
            e(sigma_u) =  .1955446779604279
            e(sigma_e) =  .0923303402322655
              e(sigma) =  .2162466480805041
                e(rho) =  .8176985584025714
               e(rmse) =  .0954854636595087
                  e(N) =  342
               e(Tbar) =  19
               e(Tcon) =  1
                e(N_g) =  18
              e(g_min) =  19
              e(g_avg) =  19
              e(g_max) =  19
              e(theta) =  .892306751153392
               e(r2_o) =  .7309214258287035
               e(r2_b) =  .7099473049693008
               e(r2_w) =  .8362628638710932

macros:
            e(cmdline) : "xtreg lgaspcar lincomep lrpmg lcarpcap, re"
                e(cmd) : "xtreg"
       e(marginsnotok) : "E U UE SCore STDP XBU"
            e(predict) : "xtrere_p"
              e(model) : "re"
               e(ivar) : "ncountry"
                e(vce) : "conventional"
             e(depvar) : "lgaspcar"
           e(chi2type) : "Wald"
         e(properties) : "b V"

matrices:
                  e(b) :  1 x 4
                  e(V) :  4 x 4
               e(VCEf) :  4 x 4
                 e(bf) :  1 x 4

functions:
             e(sample)   

. local n = e(N)

. local N = e(N_g)

. local T = e(g_max)

. local K = e(df_m)

. local p = `n'-(`K'+1)

. * Breusch and Pagan LM test for random effects
. xttest0

Breusch and Pagan Lagrangian multiplier test for random effects

        lgaspcar[ncountry,t] = Xb + u[ncountry] + e[ncountry,t]

        Estimated results:
                         |       Var     sd = sqrt(Var)
                ---------+-----------------------------
                lgaspcar |    .301299       .5489071
                       e |   .0085249       .0923303
                       u |   .0382377       .1955447

        Test:   Var(u) = 0
                             chibar2(01) =  1465.55
                          Prob > chibar2 =   0.0000

. 
. * Alternatively:
. reg lgaspcar lincomep lrpmg lcarpcap

      Source |       SS           df       MS      Number of obs   =       342
-------------+----------------------------------   F(3, 338)       =    664.00
       Model |  87.8386024         3  29.2795341   Prob > F        =    0.0000
    Residual |  14.9043581       338  .044095734   R-squared       =    0.8549
-------------+----------------------------------   Adj R-squared   =    0.8536
       Total |  102.742961       341  .301299005   Root MSE        =    .20999

------------------------------------------------------------------------------
    lgaspcar |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lincomep |   .8899616   .0358058    24.86   0.000     .8195313    .9603919
       lrpmg |  -.8917979   .0303147   -29.42   0.000    -.9514272   -.8321685
    lcarpcap |  -.7633727   .0186083   -41.02   0.000    -.7999754   -.7267701
       _cons |   2.391326   .1169343    20.45   0.000     2.161315    2.621336
------------------------------------------------------------------------------

. predict u_tilda, residuals

. mata
------------------------------------------------- mata (type end to exit) ------------------------------------------------------------------------------------------------------
: u = st_data(.,"u_tilda")

: uu = cross(u,u)

: I_N = I(`N')

: J_T = J(`T',`T',1)

: LM_1 = (`N'*`T')/(2*(`T'-1))*(1-(u'*(I_N#J_T)*u)/uu)^2

: st_numscalar("r(LM_1)",LM_1)

: end
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. local LM_1 = r(LM_1)

. display "LM test of sigma^2_mu=0: `LM_1'"
LM test of sigma^2_mu=0: 1465.552798683934

. 
. mata
------------------------------------------------- mata (type end to exit) ------------------------------------------------------------------------------------------------------
: u = st_data(.,"u_tilda")

: uu = cross(u,u)

: I_N = I(`N')

: J_T = J(`T',`T',1)

: HO = (((`N'*`T')/(2*(`T'-1)))^.5)*((u'*(I_N#J_T)*u)/uu-1)

: st_numscalar("r(HO)",HO)

: end
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. local HO = r(HO)

. display "Honda test of sigma^2_mu=0: `HO'"
Honda test of sigma^2_mu=0: 38.28253908355524

. 
. mata
------------------------------------------------- mata (type end to exit) ------------------------------------------------------------------------------------------------------
: u = st_data(.,"u_tilda")

: uu = cross(u,u)

: I_N = I(`N')

: I_n = I(`n')

: J_T = J(`T',`T',1)

: D = I_N#J_T

: d = (u'*D*u)/uu

: Z = st_data(.,("iota","lincomep","lrpmg","lcarpcap"))

: ZZ = cross(Z,Z)

: inv_ZZ = invsym(ZZ)

: P_z = I_n-Z*inv_ZZ*Z'

: E_d = trace(D*P_z)/`p'

: var_d = 2*(`p'*(trace(D*P_z))^2-(trace(D*P_z))^2)/(`p'^2*(`p'+2))

: SLM = (d-E_d)/(var_d^.5)

: st_numscalar("r(SLM)",SLM)

: end
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. local SLM = r(SLM)

. display "SLM test of sigma^2_mu=0: `SLM'"
SLM test of sigma^2_mu=0: 11.09140612960294

. 
. mata
------------------------------------------------- mata (type end to exit) ------------------------------------------------------------------------------------------------------
: u = st_data(.,"u_tilda")

: uu = cross(u,u)

: I_N = I(`N')

: J_T = J(`T',`T',1)

: A = (((`N'*`T')/(2*(`T'-1)))^.5)*((u'*(I_N#J_T)*u)/uu-1)

: if (A>0){ 
> X_m = A^2
> }
> else {
> X_m = 0
> }

: st_numscalar("r(X_m)",X_m)

: end
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. local X_m = r(X_m)

. display "GHM test of sigma^2_mu=0: `HO'"
GHM test of sigma^2_mu=0: 38.28253908355524

. 
. * d) RE, country or time effects
. mata
------------------------------------------------- mata (type end to exit) ------------------------------------------------------------------------------------------------------
: u = st_data(.,"u_tilda")

: uu = cross(u,u)

: I_N = I(`N')

: J_T = J(`T',`T',1)

: I_T = I(`T')

: J_N = J(`N',`N',1)

: LM_1 = (`N'*`T')/(2*(`T'-1))*(1-(u'*(I_N#J_T)*u)/uu)^2

: LM_2 = (`N'*`T')/(2*(`N'-1))*(1-(u'*(J_N#I_T)*u)/uu)^2

: LM = LM_1+LM_2

: st_numscalar("r(LM)",LM)

: end
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. local LM = r(LM)

. display "LM test of sigma^2_mu=0 & sigma^2_lambda=0: `LM'"
LM test of sigma^2_mu=0 & sigma^2_lambda=0: 1471.357585395472

. 
. mata
------------------------------------------------- mata (type end to exit) ------------------------------------------------------------------------------------------------------
: u = st_data(.,"u_tilda")

: uu = cross(u,u)

: I_N = I(`N')

: J_T = J(`T',`T',1)

: A = (((`N'*`T')/(2*(`T'-1)))^.5)*((u'*(I_N#J_T)*u)/uu-1)

: I_T = I(`T')

: J_N = J(`N',`N',1)

: B = (((`N'*`T')/(2*(`N'-1)))^.5)*((u'*(J_N#I_T)*u)/uu-1)

: H0 = (A+B)/(2^.5)

: st_numscalar("r(HO)",HO)

: end
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. local HO = r(HO)

. display "Honda ``handy'' one-sided test of sigma^2_mu=0 & sigma^2_lambda=0: `HO'"
Honda  one-sided test of sigma^2_mu=0 & sigma^2_lambda=0: 38.28253908355524

. 
. mata
------------------------------------------------- mata (type end to exit) ------------------------------------------------------------------------------------------------------
: u = st_data(.,"u_tilda")

: uu = cross(u,u)

: I_N = I(`N')

: I_n = I(`n')

: J_T = J(`T',`T',1)

: J_N = J(`N',`N',1)

: I_T = I(`T')

: D = 0.5*((`N'*`T'/(`T'-1))^.5)*(I_N#J_T)+.5*((`N'*`T'/(`N'-1))^.5)*(J_N#I_T)

: d = (u'*D*u)/uu

: Z = st_data(.,("iota","lincomep","lrpmg","lcarpcap"))

: ZZ = cross(Z,Z)

: inv_ZZ = invsym(ZZ)

: P_z = I_n-Z*inv_ZZ*Z'

: E_d = trace(D*P_z)/`p'

: var_d = 2*(`p'*trace(D*P_z)^2-(trace(D*P_z))^2)/(`p'^2*(`p'+2))

: SLM = (d-E_d)/(var_d^.5)

: st_numscalar("r(SLM)",SLM)

: end
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. local SLM = r(SLM)

. display "SLM test of sigma^2_mu=0 & sigma^2_lambda=0: `SLM'"
SLM test of sigma^2_mu=0 & sigma^2_lambda=0: 4.732645581877698

. 
. mata
------------------------------------------------- mata (type end to exit) ------------------------------------------------------------------------------------------------------
: u = st_data(.,"u_tilda")

: uu = cross(u,u)

: I_N = I(`N')

: J_T = J(`T',`T',1)

: A = ((`N'*`T')/(2*(`T'-1)))^.5*((u'*(I_N#J_T)*u)/uu-1)

: I_T = I(`T')

: J_N = J(`N',`N',1)

: B = ((`N'*`T')/(2*(`N'-1)))^.5*((u'*(J_N#I_T)*u)/uu-1)

: if (A>0 & B>0){ 
> X_m = A^2+B^2
> }
> else if (A>0 & B<=0) {
> X_m = A^2
> }
> else if (A<=0 & B>0) {
> X_m = B^2
> }
> else {
> X_m = 0
> }

: st_numscalar("r(X_m)",X_m)

: end
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. local X_m = r(X_m)

. display "GHM test of sigma^2_mu=0 & sigma^2_lambda=0: `HO'"
GHM test of sigma^2_mu=0 & sigma^2_lambda=0: 38.28253908355524

. 
. 
. 
. ********************************************************************************
. * Question 2 
. * a) Hausman Test: RE vs FE (1st version of Hausman Test)
. xtreg lgaspcar lincomep lrpmg lcarpcap, fe 

Fixed-effects (within) regression               Number of obs     =        342
Group variable: ncountry                        Number of groups  =         18

R-sq:                                           Obs per group:
     within  = 0.8396                                         min =         19
     between = 0.5755                                         avg =       19.0
     overall = 0.6150                                         max =         19

                                                F(3,321)          =     560.09
corr(u_i, Xb)  = -0.2468                        Prob > F          =     0.0000

------------------------------------------------------------------------------
    lgaspcar |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lincomep |   .6622498    .073386     9.02   0.000     .5178715    .8066282
       lrpmg |  -.3217025   .0440992    -7.29   0.000    -.4084626   -.2349424
    lcarpcap |  -.6404829   .0296788   -21.58   0.000    -.6988726   -.5820933
       _cons |    2.40267   .2253094    10.66   0.000     1.959401     2.84594
-------------+----------------------------------------------------------------
     sigma_u |  .34841289
     sigma_e |  .09233034
         rho |  .93438173   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(17, 321) = 83.96                    Prob > F = 0.0000

. matrix b = e(b)'

. matrix V_b = e(V)

. estimates store FE

. xtreg lgaspcar lincomep lrpmg lcarpcap, re 

Random-effects GLS regression                   Number of obs     =        342
Group variable: ncountry                        Number of groups  =         18

R-sq:                                           Obs per group:
     within  = 0.8363                                         min =         19
     between = 0.7099                                         avg =       19.0
     overall = 0.7309                                         max =         19

                                                Wald chi2(3)      =    1642.20
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
    lgaspcar |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lincomep |   .5549858   .0591282     9.39   0.000     .4390967    .6708749
       lrpmg |  -.4203893   .0399781   -10.52   0.000     -.498745   -.3420336
    lcarpcap |  -.6068402    .025515   -23.78   0.000    -.6568487   -.5568316
       _cons |   1.996699    .184326    10.83   0.000     1.635427    2.357971
-------------+----------------------------------------------------------------
     sigma_u |  .19554468
     sigma_e |  .09233034
         rho |  .81769856   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. matrix B = e(b)'

. matrix V_B = e(V)

. estimates store RE

. hausman FE RE

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |       FE           RE         Difference          S.E.
-------------+----------------------------------------------------------------
    lincomep |    .6622498     .5549858         .107264        .0434669
       lrpmg |   -.3217025    -.4203893        .0986868        .0186143
    lcarpcap |   -.6404829    -.6068402       -.0336428        .0151597
------------------------------------------------------------------------------
                           b = consistent under Ho and Ha; obtained from xtreg
            B = inconsistent under Ha, efficient under Ho; obtained from xtreg

    Test:  Ho:  difference in coefficients not systematic

                  chi2(3) = (b-B)'[(V_b-V_B)^(-1)](b-B)
                          =      302.80
                Prob>chi2 =      0.0000
                (V_b-V_B is not positive definite)

. 
. * b) Hausman Test: GLS vs OLS (4th version of Hausman Test)
. xtreg lgaspcar lincomep lrpmg lcarpcap, re 

Random-effects GLS regression                   Number of obs     =        342
Group variable: ncountry                        Number of groups  =         18

R-sq:                                           Obs per group:
     within  = 0.8363                                         min =         19
     between = 0.7099                                         avg =       19.0
     overall = 0.7309                                         max =         19

                                                Wald chi2(3)      =    1642.20
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
    lgaspcar |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lincomep |   .5549858   .0591282     9.39   0.000     .4390967    .6708749
       lrpmg |  -.4203893   .0399781   -10.52   0.000     -.498745   -.3420336
    lcarpcap |  -.6068402    .025515   -23.78   0.000    -.6568487   -.5568316
       _cons |   1.996699    .184326    10.83   0.000     1.635427    2.357971
-------------+----------------------------------------------------------------
     sigma_u |  .19554468
     sigma_e |  .09233034
         rho |  .81769856   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. matrix b = e(b)'

. matrix list b

b[4,1]
                  y1
lincomep   .55498584
   lrpmg  -.42038926
lcarpcap  -.60684015
   _cons   1.9966991

. matrix V_b = e(V)

. matrix list V_b

symmetric V_b[4,4]
            lincomep       lrpmg    lcarpcap       _cons
lincomep   .00349614
   lrpmg  -.00050835   .00159825
lcarpcap  -.00138691   .00036808   .00065102
   _cons   .00865824   .00104319  -.00243589   .03397607

. 
. reg lgaspcar lincomep lrpmg lcarpcap

      Source |       SS           df       MS      Number of obs   =       342
-------------+----------------------------------   F(3, 338)       =    664.00
       Model |  87.8386024         3  29.2795341   Prob > F        =    0.0000
    Residual |  14.9043581       338  .044095734   R-squared       =    0.8549
-------------+----------------------------------   Adj R-squared   =    0.8536
       Total |  102.742961       341  .301299005   Root MSE        =    .20999

------------------------------------------------------------------------------
    lgaspcar |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lincomep |   .8899616   .0358058    24.86   0.000     .8195313    .9603919
       lrpmg |  -.8917979   .0303147   -29.42   0.000    -.9514272   -.8321685
    lcarpcap |  -.7633727   .0186083   -41.02   0.000    -.7999754   -.7267701
       _cons |   2.391326   .1169343    20.45   0.000     2.161315    2.621336
------------------------------------------------------------------------------

. matrix B = e(b)'

. matrix list B

B[4,1]
                  y1
lincomep   .88996164
   lrpmg  -.89179786
lcarpcap  -.76337273
   _cons   2.3913257

. matrix V_B = e(V)

. matrix list V_B

symmetric V_B[4,4]
            lincomep       lrpmg    lcarpcap       _cons
lincomep   .00128206
   lrpmg  -.00086747   .00091898
lcarpcap   -.0005587   .00045037   .00034627
   _cons   .00236569   -.0007729  -.00006359   .01367363

. 
. matrix bhat = b[1..3,1..1]

. matrix list bhat

bhat[3,1]
                  y1
lincomep   .55498584
   lrpmg  -.42038926
lcarpcap  -.60684015

. matrix V_bhat = V_b[1..3,1..3]

. matrix list V_bhat

symmetric V_bhat[3,3]
            lincomep       lrpmg    lcarpcap
lincomep   .00349614
   lrpmg  -.00050835   .00159825
lcarpcap  -.00138691   .00036808   .00065102

. matrix Bhat = B[1..3,1..1]

. matrix list Bhat

Bhat[3,1]
                  y1
lincomep   .88996164
   lrpmg  -.89179786
lcarpcap  -.76337273

. matrix V_Bhat = V_B[1..3,1..3]

. matrix list V_Bhat

symmetric V_Bhat[3,3]
            lincomep       lrpmg    lcarpcap
lincomep   .00128206
   lrpmg  -.00086747   .00091898
lcarpcap   -.0005587   .00045037   .00034627

. 
. matrix inv_V_b_V_B = invsym(V_bhat-V_Bhat)

. matrix list inv_V_b_V_B

symmetric inv_V_b_V_B[3,3]
            lincomep       lrpmg    lcarpcap
lincomep   494.01624
   lrpmg  -261.17916   1610.2557
lcarpcap           0           0           0

. matrix q4 = bhat-Bhat

. matrix list q4

q4[3,1]
                 y1
lincomep  -.3349758
   lrpmg  .47140859
lcarpcap  .15653257

. matrix hausman = q4'*inv_V_b_V_B*q4

. matrix list hausman

symmetric hausman[1,1]
           y1
y1  495.75959

. 
. 
. ********************************************************************************
. * Question 3
. * a) Likelihood Ratio Test: RE vs FE 
. xtreg lgaspcar lincomep lrpmg lcarpcap, fe 

Fixed-effects (within) regression               Number of obs     =        342
Group variable: ncountry                        Number of groups  =         18

R-sq:                                           Obs per group:
     within  = 0.8396                                         min =         19
     between = 0.5755                                         avg =       19.0
     overall = 0.6150                                         max =         19

                                                F(3,321)          =     560.09
corr(u_i, Xb)  = -0.2468                        Prob > F          =     0.0000

------------------------------------------------------------------------------
    lgaspcar |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lincomep |   .6622498    .073386     9.02   0.000     .5178715    .8066282
       lrpmg |  -.3217025   .0440992    -7.29   0.000    -.4084626   -.2349424
    lcarpcap |  -.6404829   .0296788   -21.58   0.000    -.6988726   -.5820933
       _cons |    2.40267   .2253094    10.66   0.000     1.959401     2.84594
-------------+----------------------------------------------------------------
     sigma_u |  .34841289
     sigma_e |  .09233034
         rho |  .93438173   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(17, 321) = 83.96                    Prob > F = 0.0000

. est store FE

. xtreg lgaspcar lincomep lrpmg lcarpcap, re 

Random-effects GLS regression                   Number of obs     =        342
Group variable: ncountry                        Number of groups  =         18

R-sq:                                           Obs per group:
     within  = 0.8363                                         min =         19
     between = 0.7099                                         avg =       19.0
     overall = 0.7309                                         max =         19

                                                Wald chi2(3)      =    1642.20
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
    lgaspcar |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lincomep |   .5549858   .0591282     9.39   0.000     .4390967    .6708749
       lrpmg |  -.4203893   .0399781   -10.52   0.000     -.498745   -.3420336
    lcarpcap |  -.6068402    .025515   -23.78   0.000    -.6568487   -.5568316
       _cons |   1.996699    .184326    10.83   0.000     1.635427    2.357971
-------------+----------------------------------------------------------------
     sigma_u |  .19554468
     sigma_e |  .09233034
         rho |  .81769856   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store RE

. lrtest FE RE
RE does not contain scalar e(ll)
r(498);

end of do-file

r(498);

. do "C:\Users\cliu\AppData\Local\Temp\STD1e54_000000.tmp"

. lrtest RE FE
RE does not contain scalar e(ll)
r(498);

end of do-file

r(498);

. do "C:\Users\cliu\AppData\Local\Temp\STD1e54_000000.tmp"

. xtreg lgaspcar lincomep lrpmg lcarpcap, re 

Random-effects GLS regression                   Number of obs     =        342
Group variable: ncountry                        Number of groups  =         18

R-sq:                                           Obs per group:
     within  = 0.8363                                         min =         19
     between = 0.7099                                         avg =       19.0
     overall = 0.7309                                         max =         19

                                                Wald chi2(3)      =    1642.20
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
    lgaspcar |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lincomep |   .5549858   .0591282     9.39   0.000     .4390967    .6708749
       lrpmg |  -.4203893   .0399781   -10.52   0.000     -.498745   -.3420336
    lcarpcap |  -.6068402    .025515   -23.78   0.000    -.6568487   -.5568316
       _cons |   1.996699    .184326    10.83   0.000     1.635427    2.357971
-------------+----------------------------------------------------------------
     sigma_u |  .19554468
     sigma_e |  .09233034
         rho |  .81769856   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
end of do-file

. ereturn list

scalars:
               e(rank) =  4
               e(df_m) =  3
               e(chi2) =  1642.198937928722
                  e(p) =  0
            e(sigma_u) =  .1955446779604279
            e(sigma_e) =  .0923303402322655
              e(sigma) =  .2162466480805041
                e(rho) =  .8176985584025714
               e(rmse) =  .0954854636595087
                  e(N) =  342
               e(Tbar) =  19
               e(Tcon) =  1
                e(N_g) =  18
              e(g_min) =  19
              e(g_avg) =  19
              e(g_max) =  19
              e(theta) =  .892306751153392
               e(r2_o) =  .7309214258287036
               e(r2_b) =  .7099473049693014
               e(r2_w) =  .8362628638710923

macros:
            e(cmdline) : "xtreg lgaspcar lincomep lrpmg lcarpcap, re"
                e(cmd) : "xtreg"
       e(marginsnotok) : "E U UE SCore STDP XBU"
            e(predict) : "xtrere_p"
              e(model) : "re"
               e(ivar) : "ncountry"
                e(vce) : "conventional"
             e(depvar) : "lgaspcar"
           e(chi2type) : "Wald"
         e(properties) : "b V"

matrices:
                  e(b) :  1 x 4
                  e(V) :  4 x 4
               e(VCEf) :  4 x 4
                 e(bf) :  1 x 4

functions:
             e(sample)   

. do "C:\Users\cliu\AppData\Local\Temp\STD1e54_000000.tmp"

. * a) Likelihood Ratio Test: RE vs FE 
. xtreg lgaspcar lincomep lrpmg lcarpcap, re 

Random-effects GLS regression                   Number of obs     =        342
Group variable: ncountry                        Number of groups  =         18

R-sq:                                           Obs per group:
     within  = 0.8363                                         min =         19
     between = 0.7099                                         avg =       19.0
     overall = 0.7309                                         max =         19

                                                Wald chi2(3)      =    1642.20
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
    lgaspcar |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lincomep |   .5549858   .0591282     9.39   0.000     .4390967    .6708749
       lrpmg |  -.4203893   .0399781   -10.52   0.000     -.498745   -.3420336
    lcarpcap |  -.6068402    .025515   -23.78   0.000    -.6568487   -.5568316
       _cons |   1.996699    .184326    10.83   0.000     1.635427    2.357971
-------------+----------------------------------------------------------------
     sigma_u |  .19554468
     sigma_e |  .09233034
         rho |  .81769856   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. est store RE

. xtreg lgaspcar lincomep lrpmg lcarpcap, fe 

Fixed-effects (within) regression               Number of obs     =        342
Group variable: ncountry                        Number of groups  =         18

R-sq:                                           Obs per group:
     within  = 0.8396                                         min =         19
     between = 0.5755                                         avg =       19.0
     overall = 0.6150                                         max =         19

                                                F(3,321)          =     560.09
corr(u_i, Xb)  = -0.2468                        Prob > F          =     0.0000

------------------------------------------------------------------------------
    lgaspcar |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lincomep |   .6622498    .073386     9.02   0.000     .5178715    .8066282
       lrpmg |  -.3217025   .0440992    -7.29   0.000    -.4084626   -.2349424
    lcarpcap |  -.6404829   .0296788   -21.58   0.000    -.6988726   -.5820933
       _cons |    2.40267   .2253094    10.66   0.000     1.959401     2.84594
-------------+----------------------------------------------------------------
     sigma_u |  .34841289
     sigma_e |  .09233034
         rho |  .93438173   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(17, 321) = 83.96                    Prob > F = 0.0000

. est store FE

. 
. lrtest RE FE
RE does not contain scalar e(ll)
r(498);

end of do-file

r(498);

. help mixed

. do "C:\Users\cliu\AppData\Local\Temp\STD1e54_000000.tmp"

. mixed lgaspcar lincomep lrpmg lcarpcap, mle

Mixed-effects ML regression                     Number of obs     =        342

                                                Wald chi2(3)      =    2015.57
Log likelihood =  50.492882                     Prob > chi2       =     0.0000

------------------------------------------------------------------------------
    lgaspcar |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lincomep |   .8899616   .0355958    25.00   0.000     .8201951    .9597281
       lrpmg |  -.8917979   .0301369   -29.59   0.000    -.9508652   -.8327305
    lcarpcap |  -.7633727   .0184992   -41.27   0.000    -.7996304    -.727115
       _cons |   2.391326   .1162485    20.57   0.000     2.163483    2.619168
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
               var(Residual) |     .04358   .0033326      .0375141    .0506268
------------------------------------------------------------------------------

. est store FE

. mixed lgaspcar lincomep lrpmg lcarpcap || ncountry:

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log likelihood =  282.47697  
Iteration 1:   log likelihood =  282.47697  

Computing standard errors:

Mixed-effects ML regression                     Number of obs     =        342
Group variable: ncountry                        Number of groups  =         18

                                                Obs per group:
                                                              min =         19
                                                              avg =       19.0
                                                              max =         19

                                                Wald chi2(3)      =    1715.11
Log likelihood =  282.47697                     Prob > chi2       =     0.0000

------------------------------------------------------------------------------
    lgaspcar |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lincomep |   .5881335   .0637347     9.23   0.000     .4632158    .7130512
       lrpmg |  -.3780466     .04089    -9.25   0.000    -.4581896   -.2979036
    lcarpcap |  -.6163722   .0266907   -23.09   0.000    -.6686851   -.5640594
       _cons |   2.136169   .2055003    10.39   0.000     1.733396    2.538942
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
ncountry: Identity           |
                  var(_cons) |   .0854358   .0318891      .0411081    .1775632
-----------------------------+------------------------------------------------
               var(Residual) |   .0085107   .0006731      .0072886    .0099378
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 463.97        Prob >= chibar2 = 0.0000

. est store RE

. 
. lrtest RE FE

Likelihood-ratio test                                 LR chi2(1)  =    463.97
(Assumption: FE nested in RE)                         Prob > chi2 =    0.0000

Note: The reported degrees of freedom assumes the null hypothesis is not on the boundary of the parameter space.  If this is not true, then the reported test is conservative.

. 
end of do-file

. do "C:\Users\cliu\AppData\Local\Temp\STD1e54_000000.tmp"

. * b) Arellano (1993) Test: RE vs FE 
. foreach x in lgaspcar lincomep lrpmg lcarpcap {
  2. bysort ncountry: egen `x'_sum = sum(`x')
  3. bysort ncountry: egen `x'_bar = mean(`x')
  4. bysort ncountry: gen `x'_sumbackward = sum(`x')
  5. bysort ncountry: gen `x'_sumforward = `x'_sum-`x'_sumbackward
  6. bysort ncountry: gen `x'_plus = (((_N-_n)/(_N-_n+1))^.5)*(`x'-`x'_sumforward/(_N-_n))
  7. bysort ncountry: replace `x'_plus = `x'_bar if _n==_N
  8. gen `x'_add = 0
  9. bysort ncountry: replace `x'_add = `x'_bar if _n==_N
 10. }
(18 missing values generated)
(18 real changes made)
(18 real changes made)
(18 missing values generated)
(18 real changes made)
(18 real changes made)
(18 missing values generated)
(18 real changes made)
(18 real changes made)
(18 missing values generated)
(18 real changes made)
(18 real changes made)

. reg lgaspcar_plus lincomep_plus lrpmg_plus lcarpcap_plus lincomep_add lrpmg_add lcarpcap_add, vce(robust)

Linear regression                               Number of obs     =        342
                                                F(6, 335)         =    1859.57
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9870
                                                Root MSE          =     .11046

-------------------------------------------------------------------------------
              |               Robust
lgaspcar_plus |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
lincomep_plus |   .5334155   .0762501     7.00   0.000     .3834262    .6834048
   lrpmg_plus |  -.3244005   .0490645    -6.61   0.000    -.4209139   -.2278872
lcarpcap_plus |  -.6252152   .0382488   -16.35   0.000    -.7004532   -.5499771
 lincomep_add |   .0238777   .2825049     0.08   0.933    -.5318293    .5795848
    lrpmg_add |  -.5007424   .2803103    -1.79   0.075    -1.052132    .0506476
 lcarpcap_add |  -.1814225   .1803237    -1.01   0.315     -.536132    .1732869
        _cons |  -.0272894   .0088619    -3.08   0.002    -.0447214   -.0098575
-------------------------------------------------------------------------------

. matrix b = e(b)'

. matrix V = e(V)

. matrix bhat = b[4..6,1..1]

. matrix Vhat = V[4..6,4..6]

. mata: I_N = I(3)

. mata: st_matrix("r(I_N)",I_N)

. matrix R = r(I_N)

. matrix q = J(3,1,0)

. matrix mhat = R*bhat-q

. matrix covmatrixm = R*Vhat*R'

. local J = 3

. matrix F = mhat'*invsym(covmatrixm)*mhat/`J'

. matrix list F

symmetric F[1,1]
           c1
c1  7.4820421

. 
end of do-file

. exit, clear
